package com.example.algorithmdemo.ExerciseDemo.code0627_基础二分;

/**
 * @author: TinlonLin
 * @email: tinlonlin@gmail.com
 * @Date: 2022/6/27 22:11
 * @ClassName: 计算最多能观看几场演出
 * @Desc: 计算最多能观看几场演出
 * https://blog.csdn.net/nk623/article/details/124786927?spm=1001.2014.3001.5506
 * 为了庆祝中国共产党成立100周年，某公园将举行多场文艺表演，很多演出都是同时进行，一个人只能同时观看一场演出，且不能迟到早退，
 * 由于演出分布在不同的演出场地，所以连续观看的演出最少有15分钟的时间间隔，小明是一个狂热的文艺迷，想观看尽可能多的演出，
 * 现给出演出时间表，请帮小明计算他最多能观看几场演出。
 * 第一行为一个数N，表示演出场数，1<=N<=1000，
 * 接下来N行，每行两个空格分割的整数，第一个整数T表示演出的开始时间，第二个整数L表示演出的持续时间，T和L的单位为分钟，0<=T<=1440,0<L<=100.
 * 输出最多能观看的演出场数。
 * 例如：
 *
 * 输入：
 * 2
 * 720 120
 * 840 120
 *
 * 输出：
 * 1
 *
 * 输入：
 * 2
 * 0 60
 * 90 60
 *
 * 输出：
 * 2
 * @Version: V-1.0
 */
public class 计算最多能观看几场演出 {
    public static void main(String[] args) {

    }
}
