package com.example.algorithmdemo.a0630.a100分新加题29;

/**
 * @author: TinlonLin
 * @email: tilolin@qq.com
 * @Date: 2023/6/24 21:18
 * @ClassName: a29乘坐保密电梯_100_逻辑分析
 * https://blog.csdn.net/qfc_128220/article/details/130767262?spm=1001.2014.3001.5501
题目描述：
有一座保密大楼，你从0楼到达指定楼层m，必须这样的规则乘坐电梯
给定一个数字序列，每次根据序列中的数字n，上升n层或者下降n层，前后两次的方向必须相反，规定首次的方向向上，自行组织序列的顺序按规定操作到达指定楼层。
求解到达楼层的序列组合，如果不能到达楼层，给出小于该楼层的最近序列组合。
输入描述：
第一行：期望的楼层，取值范围[1,50]; 序列总个数，取值范围[1,23]
第二行：序列，每个值取值范围[1,50]
输出描述:
能够达到楼层或者小于该楼层最近的序列
备注
操作电梯时不限定楼层范围。
必须对序列中的每个项进行操作，不能只使用一部分。
 * @Desc: Todo
 * @Version: V-1.0
 */
public class a29乘坐保密电梯_100_逻辑分析 {

}
