package com.example.algorithmdemo.ExerciseDemo.code0704_BFS广搜图;

/**
 * @author: TinlonLin
 * @email: tilolin@qq.com
 * @classname: 篮球比赛_0704
 * @desc: 篮球比赛
 * https://blog.csdn.net/qq_34465338/article/details/124429066
 *
篮球（5V5）比赛中，每个球员拥有一个战斗力，每个队伍的所有球员战斗力之和为该队伍的总体战斗力
现有10个球员准备分为两队进行训练赛，教练希望2个队伍战斗力差值尽可能的小，已达到最佳训练效果。
给定10个球员的战斗力，你该如何分队，才能达到最佳效果？请输出该方案下的最小战斗力差值

输入描述：
10个篮球队员的战斗力（整数，范围[1,10000]），战斗力之间用空格分隔，如：10 9 8 7 6 5 4 3 2 1
不需要考虑异常输入的场景
输出描述：
最小的战斗力差值，如：1

示例1
输入：
10 9 8 7 6 5 4 3 2 1
输出：
1

说明：
1 2 5 9 10分为一队，3 4 6 7 8分为一队，两队战斗力之差最小，输出差值1
备注：球员分队方案不唯一，但最小战斗力差值固定是1
 *
 * @date: 2022/6/21 11:21 下午
 * @version: V-1.0
 */
public class 篮球比赛_0704 {
}
